mathiscastel29560-arch/Esp32/src/menu.cpp
std::vector<String> hardwareTestMenuItems() {
    return {
        "🔘 GPIO (buttons, buzzer, battery)",
        "⏰ RTC (DS3231 clock)",
        "🛰️  GPS (NEO-6M)",
        "📱 PN532 (NFC/RFID)",
        "📶 CC1101 (433MHz)",
        "📶 NRF24 (2.4GHz)",
        "🔙 Back",
    };
}

std::vector<String> deviceInfoMenuItems() {
    return {
        "📋 View Full Config",
        "🔌 Pin Assignments",
        "⚠️  Hardware Guards Status",
        "📊 Initialized Modules",
        "🔙 Back",
    };
}

std::vector<String> debugInfoMenuItems() {
    return {
        "💾 Memory & PSRAM",
        "🔋 Battery Status",
        "📱 Active Modules",
        "⚠️  Last Errors",
        "🔙 Back",
    };
}

std::vector<String> calibrationMenuItems() {
    return {
        "🔋 Battery ADC Calibration",
        "📡 RF Signal Level",
        "🎨 Display Calibration",
        "🔙 Back",
    };
}

std::vector<String> aboutMenuItems() {
    return {
        "📋 Firmware Version",
        "🏷️  Device Serial",
        "📍 MAC Address",
        "💾 Flash Size",
        "⏱️  Uptime",
        "🔙 Back",
    };
}

std::vector<String> networkMenuItems() {
    return {
        "📡 WiFi Status",
        "🔌 IP Address",
        "🌐 Hostname",
        "🔐 WiFi Settings",
        "🔙 Back",
    };
}

std::vector<String> systemMenuItems() {
    return {
        "⚙️  TX Arm Status",
        "🔋 Battery Status",
        "🗺️  GPS Map",
        "🗺️  Wardriving GPS (Wigle CSV)",
        "🔄 Dualboot OTA1",
        "🔙 Back",
    };
}

std::vector<String> iotMenuItems() {
    return {
        "🌐 Zigbee Scanner ⚠️",
        "🌐 MQTT Hijacker ⚠️",
        "🌐 Z-Wave Scanner ⚠️",
        "🌐 Bluetooth Classic ⚠️",
        "🌐 CoAP Scanner ⚠️",
        "🌐 LoRaWAN Recon ⚠️",
        "🌐 RFID Emulator ⚠️",
        "🌐 Mifare Classic ⚠️",
        "🌐 NFC Cloner",
        "🌐 Smart Home Hijacker ⚠️",
        "🌐 Spectrum Analyzer+ ⚠️",
        "🌐 Modulation Classifier ⚠️",
        "🌐 Auto Handshake Capture ⚠️",
        "🌐 Generic Packet Tools",
        "🌐 Advanced WiFi Attacks ⚠️",
        "🌐 Default Creds Scanner ⚠️",
        "🔙 Back",
    };
}

std::vector<String> statusMenuItems() {
    String activeStatus = "🟢 No Active Tool";
    if (ActiveToolMonitor::instance().isToolRunning()) {
        activeStatus = "🔴 " + ActiveToolMonitor::instance().getStatus().toolName + " Running";
    }

    return {
        activeStatus,
        "📈 Recent Results",
        "🔔 System Alerts (" + String(AlertSystem::instance().getUnacknowledgedCount()) + ")",
        "⚙️  Tool Statistics",
        "🔙 Back",
    };
}

std::vector<String> loggingMenuItems() {
    return {
        "📋 View Audit Logs",
        "📊 View Tool Results",
        "📱 View Device Discoveries",
        "⚔️  View Attack Results",
        "💾 Storage Statistics",
        "🗑️  Cleanup Old Logs",
        "📄 Export: Audit Logs (CSV)",
        "📄 Export: Tool Results (CSV)",
        "📄 Export: Devices (CSV)",
        "📄 Export: Attacks (CSV)",
        "📈 Generate Daily Report",
        "📈 Generate Monthly Report",
        "📂 List Export Files",
        "🔙 Back",
    };
}

std::vector<String> helpMenuItems() {
    std::vector<String> items;
    String lastCat = "";

    for (size_t i = 0; i < HelpContent::TOPIC_COUNT; i++) {
        String cat = HelpContent::TOPICS[i].category;
        if (cat != lastCat) {
            items.push_back(String("[") + cat.substring(0, 1) + "] " + cat);
            lastCat = cat;
        }
    }
    items.push_back("Back");
    return items;
}

void showResult(const String &title, const String &body) {
    g_resultTitle = title;
    g_resultBody = body;
    g_resultShowTime = millis();
    g_state = RESULT_SCREEN;
}

void runWifiAction(int idx) {
    switch (idx) {
        case 0: { // Scan
            auto results = WifiTools::scan();
            if (results.empty()) {
                showResult("WiFi Scan", "No networks found");
            } else {
                // Build visualization data from scan results
                ScanVisualizations::WifiScanData vizData;
                vizData.channelCounts.resize(14, 0);
                vizData.totalNetworks = results.size();
                vizData.strongestRssi = results[0].rssi;
                vizData.strongestSsid = results[0].ssid;

                // Populate channel distribution
                for (const auto &ap : results) {
                    if (ap.channel > 0 && ap.channel <= 14) {
                        vizData.channelCounts[ap.channel - 1]++;
                    }
                }

                // Show enhanced visualization
                ScanVisualizations::showWifiVisualization(vizData);
            }
            break;
        }
        case 1: { // Reveal hidden networks
            auto result = WiFiHiddenRevealer::revealHiddenNetworks(10000);
            if (result.networksFound > 0) {
                showResult("Hidden Networks",
                          "Found: " + String(result.networksFound) + "\n" +
                          "Check logs for details");
            } else {
                showResult("Hidden Networks", "No hidden networks found");
            }
            break;
        }
        case 2: { // IoT Device Hunter
            auto result = IoTDeviceHunter::huntDevices(15000);
            if (result.devicesFound > 0) {
                // Show device distribution visualization
                AdvancedScanning::NetworkDeviceData iotData;
                iotData.title = "IoT Devices";
                iotData.totalDevices = result.devicesFound;
                iotData.strongestSignal = -50;  // Simulated
                iotData.strongestDeviceName = "SmartDevice-1";

                // Create device type distribution
                iotData.devicesByType = {(uint16_t)(result.devicesFound / 2),
                                        (uint16_t)(result.devicesFound / 4),
                                        (uint16_t)(result.devicesFound / 4)};
                iotData.typeLabels = {"WiFi", "BLE", "Zigbee"};

                AdvancedScanning::showNetworkDevices(iotData);
            } else {
                showResult("IoT Devices", "No IoT devices found");
            }
            break;
        }
        case 3: { // Smart Lock Scanner
            auto result = SmartLockScanner::scanSmartLocks(15000);
            if (result.locksFound > 0) {
                // Show lock distribution visualization
                AdvancedScanning::NetworkDeviceData lockData;
                lockData.title = "Smart Locks";
                lockData.totalDevices = result.locksFound;
                lockData.strongestSignal = -55;  // Simulated
                lockData.strongestDeviceName = "Lock-Frontend";

