mathiscastel29560-arch/Esp32/src/menu.cpp
                AdvancedScanning::showNetworkDevices(zwaveData);
            } else {
                showResult("Z-Wave Scanner", "No nodes found");
            }
            break;
        }
        case 3: { // Bluetooth Classic
            auto result = BluetoothClassic::scanClassicDevices(10000);
            showResult("Bluetooth Classic",
                      "Devices found: " + String(result.deviceCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 4: { // CoAP Scanner
            auto result = CoapScanner::scanCoapServers(15000);
            showResult("CoAP Scanner",
                      "Servers found: " + String(result.serverCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 5: { // LoRaWAN Recon
            auto result = LoRawanRecon::scanLoRawanNetwork(20000);
            showResult("LoRaWAN Recon",
                      "Gateways found: " + String(result.gatewayCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 6: { // RFID Emulator
            auto result = RfidEmulator::emulateRfidCard("HID", 10000);
            showResult("RFID Emulator",
                      "Emulating: " + result.cardType + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 7: { // Mifare Classic
            auto result = MifareClassic::readMifareCard();
            showResult("Mifare Classic",
                      String("Card read complete\n") +
                      "Data: " + result.sectorData.substring(0, 20));
            break;
        }
        case 8: { // NFC Cloner
            auto result = NfcCloner::readNfcTag();
            showResult("NFC Cloner",
                      "UID: " + result.tagUid + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 9: { // Smart Home Hijacker
            auto result = SmarthomeHijacker::hijackPhilipsHue("192.168.1.100", 15000);
            showResult("Smart Home Hijacker",
                      "Devices controlled: " + String(result.devicesControlled) + "\n" +
                      "Bridge: " + result.bridgeIp);
            break;
        }
        case 10: { // Spectrum Analyzer+
            auto result = SpectrumAnalyzerPlus::analyzeSpectrum(400.0, 5000.0, 20000);

            // Build visualization data with simulated spectrum bins
            ScanVisualizations::SpectrumData specData;
            specData.peaksFound = result.peaksFound;
            specData.dominantFrequency = result.dominantFrequency;
            specData.dominantAmplitude = result.dominantAmplitude;

            // Create simulated frequency bins (32 bins with peaks at dominant frequency)
            specData.frequencyBins.resize(32);
            for (int i = 0; i < 32; i++) {
                uint8_t intensity = 50;  // Base noise floor

                // Add peak at dominant frequency (center)
                if (i >= 14 && i <= 18) {
                    intensity = 200 - (abs(i - 16) * 30);
                }
                // Add secondary peaks for variety
                if (i >= 4 && i <= 7) {
                    intensity = 120 - (abs(i - 5) * 20);
                }

                specData.frequencyBins[i] = (intensity < 255) ? intensity : 255;
            }

            // Show enhanced visualization
            ScanVisualizations::showSpectrumVisualization(specData);
            break;
        }
        case 11: { // Modulation Classifier
            auto result = ModulationClassifier::classifyModulation();
            showResult("Modulation Classifier",
                      "Type: " + result.modulationType + "\n" +
                      "Confidence: " + String((int)result.confidence) + "%");
            break;
        }
        case 12: { // Auto Handshake Capture
            auto result = AutoHandshakeCapture::autoCaptureHandshakes(30000);
            showResult("Auto Handshake Capture",
                      "Handshakes: " + String(result.handshakesRecovered) + "\n" +
                      "Targets: " + String(result.targetCount));
            break;
        }
        case 13: { // Generic Packet Tools
            auto result = GenericPacketTools::injectCustomPacket("ATTACK", "auto", 10000);
            showResult("Generic Packet Tools",
                      "Packets sent: " + String(result.packetsSent) + "\n" +
                      "Radio: " + result.radioType);
            break;
        }
        case 14: { // Advanced WiFi Attacks
            auto result = AdvancedWifiAttacks::executeKrackAttack(30000);
            showResult("Advanced WiFi Attacks",
                      "Success: " + String(result.success ? "Yes" : "No") + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
    }
}

void runSystemAction(int idx) {
    switch (idx) {
        case 0: { // TX Arm
            showResult("TX Arm",
                      String(TxArm::isArmed() ? "ARMED" : "LOCKED") + "\n" +
                      "Hold BACK to arm");
            break;
        }
        case 1: { // Battery
            showResult("Battery",
                      String(Battery::percent()) + "%\n" +
                      String(Battery::voltage(), 2) + "V");
            break;
        }
        case 2: { // GPS
            showResult("GPS",
                      String(GpsModule::hasFix() ? "FIX OK" : "No fix") + "\n" +
                      String(GpsModule::latitude(), 4) + " " +
                      String(GpsModule::longitude(), 4));
            break;
        }
        case 3: { // Dualboot
            showResult("Dualboot",
                      "Switching to OTA1...\n(ESP32-DIV)");
            break;
        }
    }
}

void runSettingsAction(int idx) {
    switch (idx) {
        case 0: { // Set Date/Time
            DateTime current = Settings::getRTCTime();
            showResult("Set Date/Time",
                      "Current: " + Settings::formatRTCTime(current) + "\n" +
                      "Use web UI for now\n(http://esp32-audit.local)");
            break;
        }
        case 1: { // Brightness
            Settings::setBrightness((Settings::g_config.brightness + 10) % 110);
            Settings::saveSettings();
            showResult("Brightness",
                      String(Settings::g_config.brightness) + "%");
            break;
        }
        case 2: { // Contrast
            Settings::setContrast((Settings::g_config.contrast + 10) % 110);
            Settings::saveSettings();
            showResult("Contrast",
                      String(Settings::g_config.contrast) + "%");
            break;
        }
        case 3: { // Invert Display
            Settings::toggleInvertColors();
            Settings::saveSettings();
            showResult("Invert Display",
                      Settings::g_config.invertColors ? "ON" : "OFF");
            break;
        }
        case 4: { // Auto-Lock
            Settings::g_config.autoLock = !Settings::g_config.autoLock;
            Settings::saveSettings();
            showResult("Auto-Lock",
                      Settings::g_config.autoLock ? "ON" : "OFF");
            break;
        }
        case 5: { // Logging
            Settings::g_config.enableLogging = !Settings::g_config.enableLogging;
            Settings::saveSettings();
            showResult("Logging",
                      Settings::g_config.enableLogging ? "ON" : "OFF");
            break;
        }
    }
}

