mathiscastel29560-arch/Esp32/src/menu.cpp
void runHardwareTestAction(int idx) {
    switch (idx) {
        case 0: { // GPIO Test
            showResult("GPIO Test", "Running...\nCheck serial output\n(5 seconds)");
            break;
        }
        case 1: { // RTC Test
            showResult("RTC Test", "Running...\nCheck serial output");
            break;
        }
        case 2: { // GPS Test
            showResult("GPS Test", "Running...\nWaiting for fix\n(up to 30 sec)");
            break;
        }
        case 3: { // PN532 Test
            showResult("PN532 Test", "Running...\nScanning cards\n(10 seconds)");
            break;
        }
        case 4: { // CC1101 Test
            showResult("CC1101 Test", "Running...\n433MHz listening\n(10 seconds)");
            break;
        }
        case 5: { // NRF24 Test
            showResult("NRF24 Test", "Running...\n2.4GHz sweep\n(20 seconds)");
            break;
        }
    }
}

void runDeviceInfoAction(int idx) {
    switch (idx) {
        case 0: { // Full Config
            showResult("Full Configuration",
                      String("Pins configured OK\n") +
                      "SPI: CC1101+NRF24\n" +
                      "I2C: RTC+PN532\n" +
                      "UART1: GPS\n" +
                      "See HARDWARE.md for details");
            break;
        }
        case 1: { // Pin Assignments
            showResult("Pin Assignments",
                      String("SPI: SCK=12 MOSI=11\n") +
                      "     MISO=13 CS(CC1101)=10\n" +
                      "     CS(NRF24)=14\n" +
                      "I2C: SDA=8 SCL=9\n" +
                      "GPS: RX=18 TX=17");
            break;
        }
        case 2: { // Hardware Guards
            showResult("Hardware Guards",
                      String("✓ GPS/UART1 guard active\n") +
                      "✓ CC1101/SubGhz guard\n" +
                      "✓ SPI bus arbitration\n" +
                      "✓ I2C address isolation");
            break;
        }
        case 3: { // Initialized Modules
            showResult("Initialized Modules",
                      String("✓ GPIO (buttons, buzzer)\n") +
                      "✓ RTC (DS3231)\n" +
                      "✓ GPS (if active)\n" +
                      "✓ PN532 (NFC)\n" +
                      "✓ CC1101 (433MHz)\n" +
                      "✓ NRF24 (2.4GHz)");
            break;
        }
    }
}

void runDebugInfoAction(int idx) {
    switch (idx) {
        case 0: { // Memory - Using new stats display
            std::vector<ResultsFormatter::StatEntry> stats;
            ResultsFormatter::StatEntry e1;
            e1.label = "Free Heap";
            e1.value = String(ESP.getFreeHeap() / 1024);
            e1.unit = " KB";
            stats.push_back(e1);

            ResultsFormatter::StatEntry e2;
            e2.label = "Total Heap";
            e2.value = String(ESP.getHeapSize() / 1024);
            e2.unit = " KB";
            stats.push_back(e2);

            ResultsFormatter::StatEntry e3;
            e3.label = "Free PSRAM";
            e3.value = String(ESP.getFreePsram() / 1024);
            e3.unit = " KB";
            stats.push_back(e3);

            ResultsFormatter::StatEntry e4;
            e4.label = "Total PSRAM";
            e4.value = String(ESP.getPsramSize() / 1024);
            e4.unit = " KB";
            stats.push_back(e4);

            ResultsFormatter::displayStats("System Memory", stats);
            break;
        }
        case 1: { // Battery - Using new summary display
            uint8_t percent = Battery::percent();
            ResultsFormatter::displayResult(
                "Battery Status",
                "Voltage: " + String(Battery::voltage(), 2) + "V\n" +
                "Level: " + String(percent) + "%\n" +
                "Status: " + (percent > 50 ? "Excellent" : (percent > 20 ? "Good" : "Critical")),
                percent > 20 ? ResultsFormatter::RESULT_SUCCESS : ResultsFormatter::RESULT_WARNING,
                percent
            );
            break;
        }
        case 2: { // Active Modules - Using new scan results
            std::vector<ResultsFormatter::ScanEntry> modules = {
                {"WiFi", String(WiFi.isConnected() ? "✓" : "✗"), ""},
                {"GPS", String(GpsModule::hasFix() ? "✓" : "Searching"), ""},
                {"RTC", "✓", "DS3231"},
                {"PN532", "✓", "NFC/RFID"},
                {"CC1101", "✓", "433MHz"},
                {"NRF24", "✓", "2.4GHz"},
            };
            ResultsFormatter::displayScanResults("Initialized Modules", modules);
            break;
        }
        case 3: { // Last Errors
            ResultsFormatter::displayResult(
                "System Status",
                String("No critical errors detected\n") +
                "All systems operational\n" +
                "Check logs for warnings",
                ResultsFormatter::RESULT_INFO
            );
            break;
        }
    }
}

void runCalibrationAction(int idx) {
    switch (idx) {
        case 0: { // Battery ADC
            showResult("Battery Calibration",
                      "Current reading: " + String(analogRead(7)) + "\n" +
                      "Voltage: " + String(Battery::voltage(), 2) + "V\n" +
                      "Calibrate manually if needed");
            break;
        }
        case 1: { // RF Signal
            showResult("RF Signal Check",
                      String("CC1101: Ready\n") +
                      "NRF24: Ready\n" +
                      "Run RF tests for details");
            break;
        }
        case 2: { // Display
            showResult("Display Calibration",
                      "Brightness: " + String(Settings::g_config.brightness) + "%\n" +
                      "Contrast: " + String(Settings::g_config.contrast) + "%\n" +
                      "Adjust in Settings menu");
            break;
        }
    }
}

void runAboutAction(int idx) {
    switch (idx) {
        case 0: { // Firmware Version
            showResult("Firmware Version",
                      String("ESP32-S3 Offensive\n") +
                      "Security Platform\n" +
                      "Version: 2.0.0\n" +
                      "Build: 20250922");
            break;
        }
        case 1: { // Device Serial
            uint64_t chipid = ESP.getEfuseMac();
            showResult("Device Serial",
                      "Chip ID: " + String((uint32_t)(chipid >> 32), HEX) +
                      String((uint32_t)chipid, HEX));
            break;
        }
        case 2: { // MAC Address
            showResult("MAC Address",
                      "WiFi: " + WiFi.macAddress() + "\n" +
                      "BLE: (same as WiFi)");
            break;
        }
        case 3: { // Flash Size
            showResult("Flash Size",
                      "Total: " + String(ESP.getFlashChipSize() / (1024*1024)) + " MB\n" +
                      "Used: ~50% (estimated)\n" +
                      "Free: ~50% (estimated)");
            break;
        }
        case 4: { // Uptime
            uint32_t uptimeSeconds = millis() / 1000;
            uint32_t hours = uptimeSeconds / 3600;
            uint32_t minutes = (uptimeSeconds % 3600) / 60;
            showResult("Uptime",
                      String(hours) + "h " + String(minutes) + "m");
            break;
        }
    }
}

void runNetworkAction(int idx) {
    switch (idx) {
        case 0: { // WiFi Status
            showResult("WiFi Status",
                      "Status: " + String(WiFi.isConnected() ? "Connected" : "Disconnected") + "\n" +
                      "SSID: " + (WiFi.isConnected() ? WiFi.SSID() : "N/A") + "\n" +
                      "RSSI: " + (WiFi.isConnected() ? String(WiFi.RSSI()) + "dBm" : "N/A"));
            break;
        }
        case 1: { // IP Address
            showResult("IP Address",
                      String("IP: ") + (WiFi.isConnected() ? WiFi.localIP().toString() : "Not connected") + "\n" +
                      "Gateway: " + (WiFi.isConnected() ? WiFi.gatewayIP().toString() : "N/A"));
            break;
        }
        case 2: { // Hostname
            showResult("Hostname",
                      String("esp32-audit.local\n") +
                      "or IP from WiFi section");
            break;
        }
        case 3: { // WiFi Settings
            showResult("WiFi Settings",
                      String("Use web UI for\n") +
                      "WiFi configuration:\n" +
                      "http://esp32-audit.local");
            break;
        }
    }
}

void runStatusAction(int idx) {
    switch (idx) {
        case 0: { // Active Tool Status
            if (ActiveToolMonitor::instance().isToolRunning()) {
                const auto& status = ActiveToolMonitor::instance().getStatus();
                showResult("Active Tool",
                          "Tool: " + status.toolName + "\n" +
                          "Status: " + status.status + "\n" +
                          "Progress: " + String(status.progress) + "%\n" +
                          "Events: " + String(status.eventCount) + "\n" +
                          "Elapsed: " + ActiveToolMonitor::instance().getElapsedFormatted());
            } else {
                showResult("Active Tool", "No tool currently running");
            }
            break;
        }
        case 1: { // Recent Results
            RecentResultsTracker::instance().displayRecent(5);
            break;
        }
        case 2: { // System Alerts
            AlertSystem::instance().displayUnacknowledged();
            break;
        }
        case 3: { // Tool Statistics
            uint32_t total = RecentResultsTracker::instance().getTotalResults();
            uint32_t success = RecentResultsTracker::instance().getSuccessCount();
            uint32_t failure = RecentResultsTracker::instance().getFailureCount();
            uint8_t rate = RecentResultsTracker::instance().getSuccessRate();

            String stats = "Total Executions: " + String(total) + "\n" +
                          "Successful: " + String(success) + " ✅\n" +
                          "Failed: " + String(failure) + " ❌\n" +
                          "Success Rate: " + String(rate) + "%";
            showResult("Tool Statistics", stats);
            break;
        }
    }
}

void runLoggingAction(int idx) {
    switch (idx) {
        case 0: // View Audit Logs
            LogViewerMenu::instance().viewAuditLogs();
            break;
        case 1: // View Tool Results
            LogViewerMenu::instance().viewToolResults();
            break;
        case 2: // View Device Discoveries
            LogViewerMenu::instance().viewDeviceResults();
            break;
        case 3: // View Attack Results
            LogViewerMenu::instance().viewAttackResults();
            break;
        case 4: // Storage Statistics
            LogViewerMenu::instance().viewStorageStats();
            break;
        case 5: // Cleanup Old Logs
            LogViewerMenu::instance().cleanupOldLogs();
            break;
        case 6: // Export Audit Logs (CSV)
            ExportManager::instance().exportAuditLogsCSV();
            break;
        case 7: // Export Tool Results (CSV)
            ExportManager::instance().exportToolResultsCSV();
            break;
        case 8: // Export Devices (CSV)
            ExportManager::instance().exportDevicesCSV();
            break;
        case 9: // Export Attacks (CSV)
            ExportManager::instance().exportAttacksCSV();
            break;
        case 10: // Generate Daily Report
            ExportManager::instance().generateDailySummary();
            showResult("Daily Report", "✓ Report generated\nCheck /results/ directory");
            break;
        case 11: // Generate Monthly Report
            ExportManager::instance().generateMonthlySummary();
            showResult("Monthly Report", "✓ Report generated\nCheck /results/ directory");
            break;
        case 12: // List Export Files
            ExportManager::instance().listExportFiles();
            break;
    }
}

