mathiscastel29560-arch/Esp32/src/menu.cpp
        case NETWORK_SUBMENU:
            items = networkMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 11;
                } else {
                    runNetworkAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "NETWORK");
            break;

        case STATUS_SUBMENU:
            items = statusMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 13;
                } else {
                    runStatusAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "STATUS & ALERTS");
            break;

        case LOGGING_SUBMENU:
            items = loggingMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 12;
                } else {
                    runLoggingAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "LOGS & RESULTS");
            break;

        case HELP_SUBMENU:
            items = helpMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 14;
                } else {
                    // Extract category name from menu item (e.g., "[W] WiFi" -> "WiFi")
                    String menuItem = items[g_selection];
                    int spaceIdx = menuItem.indexOf(' ');
                    String cat = menuItem.substring(spaceIdx + 1);
                    for (size_t i = 0; i < HelpContent::TOPIC_COUNT; i++) {
                        if (String(HelpContent::TOPICS[i].category) == cat) {
                            showResult(HelpContent::TOPICS[i].title,
                                     HelpContent::TOPICS[i].body);
                            break;
                        }
                    }
                }
            }
            drawSimpleMenu(items, g_selection, "HELP");
            break;

        case RESULT_SCREEN: {
            Serial.println();
            drawStatusBar();
            Serial.println();

            Serial.print(COLOR_GREEN);
            Serial.println("╔═════════════════════════════════════════╗");
            Serial.print("║  ✓ ");
            Serial.print(g_resultTitle);
            Serial.println(String(33 - g_resultTitle.length(), ' ') + "║");
            Serial.println("╠═════════════════════════════════════════╣");
            Serial.print(COLOR_RESET);

            // Print body with line wrapping
            String body = g_resultBody;
            int lines = 0;
            int pos = 0;
            while (pos < body.length() && lines < 5) {
                int nextNewline = body.indexOf('\n', pos);
                if (nextNewline == -1) nextNewline = body.length();

                String line = body.substring(pos, nextNewline);
                if (line.length() > 37) line = line.substring(0, 37);

                Serial.print(COLOR_CYAN);
                Serial.print("║  " + line);
                Serial.print(COLOR_RESET);
                Serial.println(String(39 - line.length(), ' ') + "║");

                pos = nextNewline + 1;
                lines++;
            }

            // Fill remaining lines
            while (lines < 5) {
                Serial.print(COLOR_CYAN);
                Serial.println("║" + String(41, ' ') + "║");
                Serial.print(COLOR_RESET);
                lines++;
            }

            Serial.print(COLOR_GREEN);
            Serial.println("╠═════════════════════════════════════════╣");
            Serial.print(COLOR_YELLOW);
            Serial.println("║  ●: continue  ◄: back                  ║");
            Serial.print(COLOR_GREEN);
            Serial.println("╚═════════════════════════════════════════╝");
            Serial.print(COLOR_RESET);

            if (okPress || backTap) {
                g_state = MAIN_MENU;
                g_selection = 0;
            }
            break;
        }
        default:
            break;
    }
}

bool isActive() {
    return g_state != HOME;
}

} // namespace Menu
